<html>
<h1>Soft Group</h1>
<h2>Тестове завдання 6</h2>
<p>Змагання з гри «Тетріс-онлайн» проводяться за такими правилами:
Кожен учасник реєструється на сайті гри під певним ігровим ім'ям. Імена
учасників не повторюються.</p>
<p>Чемпіонат проводиться протягом певного часу. У будь-який момент цього
часу будь-який зареєстрований учасник може зайти на сайт чемпіонату і
почати залікову гру. Після закінчення гри її результат (кількість балів)
фіксується і заноситься до протоколу.</p>
<p>Учасники мають право грати кілька разів. Кількість спроб одного учасника
не обмежується. Остаточний результат учасника визначається по одній грі,
кращою для даного учасника. Більш високе місце в змаганнях займає
учасник, що показав кращий результат. При рівності результатів більш
високе місце займає учасник, раніше показав кращий результат.<p>
<p>В ході змагань заповнюється протокол, кожен рядок якого описує одну гру
і містить результат учасника і його ігрове ім'я. Протокол формується в
реальному часі по ходу проведення чемпіонату, тому рядки в ньому
розташовані в порядку проведення ігор: чим раніше зустрічається рядок у
протоколі, тим раніше закінчилася відповідна цьому рядку гра.</p>
<p>Напишіть програму, яка за даними протоколу визначає переможця і
призерів. Гарантується, що в чемпіонаті бере участь не менше трьох гравців.</p>
<h4>Приклад:</h4>
<table>
	<tr>
		<td>Ввід</td>
		<td>Вивід</td>
	</tr>
	<tr>
		<td>
			9</br> 
69485 Jack </br>
95715 qwerty </br>
95715 Alex</br>
83647 M</br>
197128 qwerty</br>
95715 Jack</br>
93289 Alex</br>
95715 Alex</br>
95715 M
		</td>
		<td>1 місце. Qwerty (197128)</br>2 місце. Alex (95715)</br>3 місце. Jack (95715)
		</td>
	</tr>
</table>
<hr>
<form id="task-form" method="POST" action="">
	Сформуйте протокол:</br>
	<input type="hidden" id="task" name="task" value="6" type="text">
	<textarea name="words" cols="80" rows="10"></textarea></br></br>
	<input type="button" value="Підрахувати" onclick="AjaxFormRequest('results', 'task-form', 'ajax.php')" />
</form>
<hr>
<div id="results"></div>
</html>