<html>
<h1>Soft Group</h1>
<h2>Тестове завдання 1</h2>
<p>Політичне життя однієї країни дуже жваве. У країні діє K політичних
партій, кожна з яких регулярно оголошує національний страйк. Дні, коли
хоча б одна з партій оголошує страйк, за умови, що це не субота або неділя
(коли і так ніхто не працює), завдають великої шкоди економіці країни.
i-та партія оголошує страйки строго кожні bi днів, починаючи з дня з
номером ai. Тобто i-та партія оголошує страйки в дні ai, ai + bi, ai + 2bi і т.д.</p>
<p>Якщо в якийсь день кілька партій оголошує страйк, то це вважається
загальнонаціональним страйком.</p>
<p>У календарі країни N днів, пронумерованих від 1 до N. Перший день
року є понеділком, шостий і сьомий дні року - вихідні, тиждень складається
з семи днів.</p>
<h4>Вхідні дані</h4>
<p>Програма отримує на вхід число днів в році N (1< N < 1000000) і число
політичних партій K (1 < K < 100). Далі йде K рядків, що описують графіки
проведення страйків. i-й рядок містить числа ai і bi (1 < ai ,bi < N).</p>
<h4>Вихідні дані</h4>
<p>Виведіть єдине число: кількість страйків, що відбулися протягом року.</p>
<h4>Примітка</h4>
<p>Перша партія оголошує страйки в дні 2, 5, 8, 11, 14, 17. Друга партія
оголошує страйки в дні 3, 8, 13, 18. Третя партія - в дні 9 і 17. Дні номер 6,
7, 13, 14 є вихідними. Таким чином, загальнонаціональні страйки пройдуть в
дні 2, 3, 5, 8, 9, 11, 17, 18.</p>
<hr>
<form id="task-form" method="POST" action="">
	<input type="hidden" name="task" value="4" type="text">
	Число днів в році: <input name="days" type="text" size="7"> Число політичних партій: <input id="part-input" name="parties" type="text" size="3"></br>
	<div id="part-count">

	</div>
	</br>
	<input type="button" value="Підрахувати" onclick="AjaxFormRequest('results', 'task-form', 'ajax.php')" />
</form>
<hr>
<div id="results"></div>
</html>